[
  {
    "_id": "RS101",
    "name": "HTML/CSS",
    "number": "RS4550",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D123",
    "credits": 4,
    "description": "This course provides an in-depth study of the fundamentals of HTML and CSS for web development. Students will learn how to create and style web pages using HTML elements, CSS properties, and layout techniques. The course covers topics such as responsive design, typography, forms, and multimedia integration, equipping students with the skills to build modern and visually appealing websites. Emphasis is placed on hands-on practice and project-based learning to reinforce concepts and develop proficiency in using HTML and CSS.",
    "image": "/images/htmlcss.jpg"
  },
  {
    "_id": "RS102",
    "name": "Bootstrap",
    "number": "RS4560",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D123",
    "credits": 3,
    "description": "This course provides an in-depth study of the fundamentals of Bootstrap framework for responsive web design. Students will learn how to create responsive web pages using Bootstrap's grid system, components, and utilities. The course covers topics such as layout design, navigation bars, forms, modals, and carousels, equipping students with the skills to build modern and user-friendly websites. Emphasis is placed on hands-on practice and project-based learning to reinforce concepts and develop proficiency in using Bootstrap.",
    "image": "/images/bootstrap.jpg"
  },
  {
    "_id": "RS103",
    "name": "React JS",
    "number": "RS4570",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D123",
    "credits": 4,
    "description": "This course provides an in-depth study of React JS library for building interactive user interfaces. Students will learn how to create components, manage state, handle events, and use hooks in React applications. The course covers topics such as JSX syntax, props, routing, and form handling, equipping students with the skills to develop dynamic and responsive web applications. Emphasis is placed on hands-on practice and project-based learning to reinforce concepts and develop proficiency in using React JS.",
    "image": "/images/react.jpg"
  },
  {
    "_id": "RS104",
    "name": "Node JS",
    "number": "CH1230",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D134",
    "credits": 3,
    "description": "This course provides an in-depth study of Node.js and its core modules, focusing on topics such as event-driven programming, asynchronous I/O, and the Node.js ecosystem. Students will learn how to create servers, handle requests, and interact with databases using Node.js and popular frameworks like Express. Emphasis is placed on hands-on practice and project-based learning to reinforce concepts and develop proficiency in using Node.js.",
    "image": "/images/node.png"
  },
  {
    "_id": "RS105",
    "name": "Redux",
    "number": "CH1240",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D134",
    "credits": 3,
    "description": "This course provides an in-depth study of Redux and its core concepts, focusing on topics such as actions, reducers, stores, and middleware. Students will learn how to integrate Redux with React applications, manage application state, and handle asynchronous actions. Emphasis is placed on hands-on practice and project-based learning to reinforce concepts and develop proficiency in using Redux.",
    "image": "/images/redux.jpg"
  },
  {
    "_id": "RS106",
    "name": "MongoDB",
    "number": "CH1250",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D134",
    "credits": 3,
    "description": "This course provides an in-depth study of MongoDB and its features, focusing on topics such as document-oriented data modeling, querying, indexing, and aggregation. Students will learn how to interact with MongoDB using the MongoDB shell and popular libraries like Mongoose. Emphasis is placed on hands-on practice and project-based learning to reinforce concepts and develop proficiency in using MongoDB.",
    "image": "/images/mongoDB.jpg"
  },
  {
    "_id": "RS107",
    "name": "API",
    "number": "ME101",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "Languages",
    "credits": 3,
    "description": "This course provides an in-depth study of RESTful APIs and their design principles, focusing on topics such as HTTP methods, status codes, authentication, and documentation. Students will learn how to create, consume, and test APIs using tools like Postman and Swagger. Emphasis is placed on hands-on practice and project-based learning to reinforce concepts and develop proficiency in designing and implementing APIs.",
    "author": "654f9ec2ea7ead465908d1e3",
    "image": "/images/api.jpg"
  }
]
